Repository: frsfahd/story_app
Catalog: lib/l10n/app_*.arb
Languages: id

# loginHeader
source: Sign In
id: Masuk

# loginSubHeader
source: Sign In to your account to view and manage your learning stories.
id: Masuk ke akun Anda untuk melihat dan mengelola cerita pengalaman belajar Anda.

# loginEmailHintText
source: Enter a registered email address
id: Masukkan email yang terdaftar

# loginEmailValidator
source: Please enter a registered email address
id: Mohon masukkan email yang telah terdaftar

# loginEmailValidator2
source: Please enter a valid email address
id: Mohon masukkan email yang valid

# loginPasswordLabel
source: Password
id: Kata Sandi

# loginPasswordValidator
source: Please enter your password
id: Mohon masukkan kata sandi

# loginPasswordValidator2
source: Minimum password length of 8 characters
id: Kata sandi minimal 8 karakter

# loginButton
source: Sign In
id: Masuk

# loginForgetPassword
source: Forget password ?
id: Lupa kata sandi ?

# loginToRegisterText
source: don't have an account yet ?
id: Belum punya akun ?

# loginToRegisterButton
source: Register
id: Daftar

# registerSuccessSnackbar
source: Registration successful, please sign in
id: Pendaftaran berhasil, silakan masuk

# registerHeader
source: Registration
id: Daftar

# registerSubHeader
source: Create an account to view and manage your learning stories.
id: Buat akun untuk melihat dan mengelola cerita pengalaman belajar Anda.

# registerNameLabel
source: Name
id: Nama

# registerNameHintText
source: Enter your name
id: Masukkan nama anda

# registerNameValidator
source: Please enter your name
id: Mohon masukkan nama lengkap

# registerNameValidator2
source: Minimum name length of 3 characters
id: Nama minimal 3 karakter

# registerEmailHintText
source: Enter your email address
id: Masukkan email anda

# registerEmailValidator
source: Please enter your email address
id: Mohon masukkan email anda

# registerEmailValidator2
source: Please enter a valid email address
id: Mohon maasukkan email yang valid

# registerPasswordLabel
source: Password
id: Kata Sandi

# registerPasswordHintText
source: Enter a password
id: Masukkan kata sandi

# registerPasswordValidator
source: Please enter a password
id: Mohon masukkan kata sandi

# registerPasswordValidator2
source: Minimum password length of 8 characters
id: Kata sandi minimal 8 karakter

# registerPasswordConfirmLabel
source: Password Confirmation
id: Konfirmasi kata sandi

# registerPasswordConfirmHintText
source: Re-enter your password
id: Masukkan ulang kata sandi

# registerPasswordConfirmValidator
source: Please re-enter your password
id: Mohon konfirmasi kata sandi

# registerPasswordConfirmValidator2
source: Password does not match
id: Konfirmasi kata sandi tidak cocok

# registerButton
source: Register
id: Daftar

# registerAccountExisted
source: Already have an account ?
id: Sudah punya akun ?

# registerToLoginButton
source: Sign In
id: Masuk

# homeTitle
source: Stories
id: Semua Cerita

# homeErrNoStory
source: No story available
id: Tidak ada cerita tersedia

# homeStoryDate
source: Uploaded at {createdAt}
id: Diunggah pada {createdAt}

# homeLogout
source: Sign Out
id: Keluar

# homeLogoutCancel
source: Cancel
id: Batal

# homeLogoutConfirmContent
source: Are you sure you want to sign out?
id: Apakah Anda yakin ingin keluar?

# detailTitle
source: Story Detail
id: Cerita

# newStoryTitle
source: New Story
id: Cerita Baru

# newStoryCameraButton
source: Camera
id: Kamera

# newStoryGalleryButton
source: Gallery
id: Galeri

# newStoryDescLabel
source: Description
id: Deskripsi

# newStoryErrEmptyPic
source: Image must not be empty
id: Gambar tidak boleh kosong

# newStoryErrEmptyDesc
source: Description must not be empty
id: Deskripsi tidak boleh kosong

# newStoryButton
source: Upload
id: Unggah
